In [60]:
import pandas as pd
import numpy as np

from pprint import pprint

In [65]:
from parent_in_path import add_parent_to_path

In [3]:
path = add_parent_to_path()

In [61]:
pprint(path)

['/Users/mjboothaus/code/github/mjboothaus/titanic/notebooks',
 '/Users/mjboothaus/.vscode/extensions/ms-toolsai.jupyter-2022.7.1102252217/pythonFiles',
 '/Users/mjboothaus/.vscode/extensions/ms-toolsai.jupyter-2022.7.1102252217/pythonFiles/lib/python',
 '/Users/mjboothaus/.pyenv/versions/3.9.12/lib/python39.zip',
 '/Users/mjboothaus/.pyenv/versions/3.9.12/lib/python3.9',
 '/Users/mjboothaus/.pyenv/versions/3.9.12/lib/python3.9/lib-dynload',
 '',
 '/Users/mjboothaus/code/github/mjboothaus/titanic/.venv_dev_titanic-streamlit-app/lib/python3.9/site-packages',
 '/Users/mjboothaus/code/github/mjboothaus/titanic']

In [5]:
from app.src.datasource import load_data

2022-09-07 15:59:08.202 INFO    visions.backends: Pandas backend loaded 1.4.3
2022-09-07 15:59:08.205 INFO    visions.backends: Numpy backend loaded 1.23.2
2022-09-07 15:59:08.205 INFO    visions.backends: Pyspark backend NOT loaded
2022-09-07 15:59:08.206 INFO    visions.backends: Python backend loaded

In [6]:
train_df, test_df = load_data()

In [7]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [9]:
train_df.drop(columns=["Survived"], inplace=True)

In [10]:
train_df.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [12]:
all_df = pd.concat([train_df, test_df])

In [13]:
all_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Pclass       1309 non-null   int64
 2   Name         1309 non-null   object
 3   Sex          1309 non-null   object
 4   Age          1046 non-null   float64
 5   SibSp        1309 non-null   int64
 6   Parch        1309 non-null   int64
 7   Ticket       1309 non-null   object
 8   Fare         1308 non-null   float64
 9   Cabin        295 non-null    object
 10  Embarked     1307 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

In [14]:
all_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
all_df.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [16]:
oldest_passenger = 65

In [17]:
all_df[all_df["Age"] > oldest_passenger]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
96,97,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
672,673,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
851,852,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
81,973,1,"Straus, Mr. Isidor",male,67.0,1,0,PC 17483,221.7792,C55 C57,S
96,988,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S

In [18]:
enc_titanica_df = pd.read_excel("../data/titanica new detail.xlsx")

In [19]:
enc_titanica_df.head()

,URL,Name,Victim/Survivor,Born,Age,Last Residence,Occupation,Class,Embarked,Tcket,Destination,Death,Body Recovery0
0,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Jirjis Yūsuf Abī Sa'b (Gerios Yousseff),Titanic Victim,Born:circa.1867 Born in Tuḥūm Lebanon,Age: 45 years (Male),Last Residence: in Hardin Lebanon,Occupation: Shoemaker,3rd Class Passengers,First Embarked: Cherbourg on Wednesday 10th Ap...,"Ticket No. 2685, £7 4s 6d",Destination: Youngstown Ohio United States,Died in the Titanic disaster (15th April 1912).,Body recovered by: Minia (No. 312)
1,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Nāsīf Qāsim Abī-Al-Munà,Titanic Survivor,Born: Monday 29th September 1884 in Shana Lebanon,Age: 27 years 6 months and 16 days (Male),Last Residence: in Shana Lebanon,NaN,3rd Class Passengers,First Embarked: Cherbourg on Wednesday 10th Ap...,"Ticket No. 2699, £18 15s 9d",Destination: Fredericksburg Virginia United St...,Rescued (boat 15),NaN
2,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Anthony Abbing,Titanic Victim,Born:1870,Age: 42 years (Male),Last Residence: in Cincinnati Ohio United States,Occupation: Blacksmith,3rd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. 5547, £7 11s",Destination: Cincinnati Ohio United States,Died in the Titanic disaster (15th April 1912).,Body Not Recovered
3,https://www.encyclopedia-titanica.org/titanic-...,Name: Mrs Rhoda Mary 'Rosa' Abbott (née Hunt),Titanic Survivor,Born: Tuesday 14th January 1873 in Aylesbury B...,Age: 39 years 3 months and 1 day (Female),Last Residence: in East Providence Rhode Islan...,NaN,3rd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. CA2673, £20 5s",Destination: East Providence Rhode Island Unit...,Rescued (boat A),NaN
4,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Rossmore Edward Abbott,Titanic Victim,Born: Friday 21st February 1896,Age: 16 years 1 month and 23 days (Male),Last Residence: in East Providence Rhode Islan...,Occupation: Jeweller,3rd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. CA2673, £20 5s",Destination: East Providence Rhode Island Unit...,Died in the Titanic disaster (15th April 1912).,Body recovered by: Mackay-Bennett (No. 190)

In [20]:
print(enc_titanica_df["URL"].iloc[0])

https://www.encyclopedia-titanica.org/titanic-victim/gerios-yousseff-abi-saab.html

In [21]:
def extract_name_enc_titanica_data(name):
    return name.replace("Name: ", "")

In [22]:
extract_name_enc_titanica_data(enc_titanica_df["Name"].iloc[0])

"Mr Jirjis Yūsuf Abī Sa'b (Gerios Yousseff)"

In [23]:
extract_name_enc_titanica_data(enc_titanica_df["Name"].iloc[1])

'Mr Nāsīf Qāsim Abī-Al-Munà'

In [24]:
extract_name_enc_titanica_data(enc_titanica_df["Name"].iloc[2])

'Mr Anthony Abbing'

In [25]:
extract_name_enc_titanica_data(enc_titanica_df["Name"].iloc[3])

"Mrs Rhoda Mary 'Rosa' Abbott (née Hunt)"

In [26]:
extract_name_enc_titanica_data(enc_titanica_df["Name"].iloc[4])

'Mr Rossmore Edward Abbott'

In [27]:
def extract_title_enc_titanica_data(name):
    return name.split(" ")[1]

In [28]:
enc_titanica_df["Title"] = enc_titanica_df["Name"].apply(lambda name: extract_title_enc_titanica_data(name))

In [44]:
enc_titanica_df.nunique()

URL                1317
Name               1316
Victim/Survivor       2
Born               1156
Age                 996
Last Residence      547
Occupation          190
Class                 3
Embarked              8
Tcket               937
Destination         264
Death                27
Body Recovery0      132
Title                21
Sex                   2
dtype: int64

In [45]:
enc_titanica_df["Survived"] = enc_titanica_df["Victim/Survivor"].map({"Titanic Victim": 0, "Titanic Survivor": 1})

In [47]:
enc_titanica_df.head()

,URL,Name,Victim/Survivor,Born,Age,Last Residence,Occupation,Class,Embarked,Tcket,Destination,Death,Body Recovery0,Title,Sex,Survived
0,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Jirjis Yūsuf Abī Sa'b (Gerios Yousseff),Titanic Victim,Born:circa.1867 Born in Tuḥūm Lebanon,Age: 45 years (Male),Last Residence: in Hardin Lebanon,Occupation: Shoemaker,3rd Class Passengers,First Embarked: Cherbourg on Wednesday 10th Ap...,"Ticket No. 2685, £7 4s 6d",Destination: Youngstown Ohio United States,Died in the Titanic disaster (15th April 1912).,Body recovered by: Minia (No. 312),Mr,Male,0
1,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Nāsīf Qāsim Abī-Al-Munà,Titanic Survivor,Born: Monday 29th September 1884 in Shana Lebanon,Age: 27 years 6 months and 16 days (Male),Last Residence: in Shana Lebanon,NaN,3rd Class Passengers,First Embarked: Cherbourg on Wednesday 10th Ap...,"Ticket No. 2699, £18 15s 9d",Destination: Fredericksburg Virginia United St...,Rescued (boat 15),NaN,Mr,Male,1
2,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Anthony Abbing,Titanic Victim,Born:1870,Age: 42 years (Male),Last Residence: in Cincinnati Ohio United States,Occupation: Blacksmith,3rd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. 5547, £7 11s",Destination: Cincinnati Ohio United States,Died in the Titanic disaster (15th April 1912).,Body Not Recovered,Mr,Male,0
3,https://www.encyclopedia-titanica.org/titanic-...,Name: Mrs Rhoda Mary 'Rosa' Abbott (née Hunt),Titanic Survivor,Born: Tuesday 14th January 1873 in Aylesbury B...,Age: 39 years 3 months and 1 day (Female),Last Residence: in East Providence Rhode Islan...,NaN,3rd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. CA2673, £20 5s",Destination: East Providence Rhode Island Unit...,Rescued (boat A),NaN,Mrs,Female,1
4,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Rossmore Edward Abbott,Titanic Victim,Born: Friday 21st February 1896,Age: 16 years 1 month and 23 days (Male),Last Residence: in East Providence Rhode Islan...,Occupation: Jeweller,3rd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. CA2673, £20 5s",Destination: East Providence Rhode Island Unit...,Died in the Titanic disaster (15th April 1912).,Body recovered by: Mackay-Bennett (No. 190),Mr,Male,0

In [46]:
enc_titanica_df.tail()

,URL,Name,Victim/Survivor,Born,Age,Last Residence,Occupation,Class,Embarked,Tcket,Destination,Death,Body Recovery0,Title,Sex,Survived
1312,https://www.encyclopedia-titanica.org/titanic-...,Name: Miss Henriette Yvois,Titanic Victim,Born:circa.1888,Age: 24 years (Female),Last Residence: in Paris France,NaN,2nd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. 248747, £13",Destination: Montreal Québec Canada,Died in the Titanic disaster (15th April 1912).,Body Not Recovered,Miss,Female,0
1313,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Ortin Zakarian,Titanic Victim,Born:circa.1885,Age: 27 years (Male),Last Residence: in Kigi Turkey,Occupation: General Labourer,3rd Class Passengers,First Embarked: Cherbourg on Wednesday 10th Ap...,"Ticket No. 2670, £7 4s 6d",Destination: Brantford Ontario Canada,Died in the Titanic disaster (15th April 1912).,Body Not Recovered,Mr,Male,0
1314,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Mapriededer Zakarian,Titanic Victim,Born:circa.1890,Age: 22 years (Male),Last Residence: in Kigi Turkey,NaN,3rd Class Passengers,First Embarked: Cherbourg on Wednesday 10th Ap...,"Ticket No. 2656, £7 4s 6d",Destination: Brantford Ontario Canada,Died in the Titanic disaster (15th April 1912).,Body recovered by: Mackay-Bennett (No. 304),Mr,Male,0
1315,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Philip Zenni,Titanic Survivor,Born: Monday 25th October 1886,Age: 25 years 5 months and 21 days (Male),Last Residence: in Tula Lebanon,Occupation: General Labourer,3rd Class Passengers,First Embarked: Cherbourg on Wednesday 10th Ap...,"Ticket No. 2620, £7 4s 6d",Destination: Dayton United States,Rescued (boat 6),NaN,Mr,Male,1
1316,https://www.encyclopedia-titanica.org/titanic-...,Name: Mr Leo Zimmermann,Titanic Victim,Born: Tuesday 20th February 1883,Age: 29 years 1 month and 23 days (Male),Last Residence: in Todtmoos Germany,Occupation: Farmer,3rd Class Passengers,First Embarked: Southampton on Wednesday 10th ...,"Ticket No. 315082, £7 17s 6d",Destination: Saskatoon Saskatchewan Canada,Died in the Titanic disaster (15th April 1912).,Body Not Recovered,Mr,Male,0

In [72]:
def extract_age_enc_titanica(age):
    age_list = age.replace("(Male)", "").replace("(Female", "").split(" ")[1:-1]
    try:
        age_years = float(age_list[0])
        if len(age_list) == 4:
            age_years += float(age_list[2]) / 12.0
        elif len(age_list) == 7:
            age_years += float(age_list[2]) / 12.0
            age_years += float(age_list[5]) / 365.0
        else:
            age_years = np.nan
    except Exception as IndexError:
        print(age)
        age_years = np.nan
    return round(age_years, 2)

In [73]:
extract_age_enc_titanica(enc_titanica_df["Age"].iloc[1])

27.54

In [74]:
extract_age_enc_titanica(enc_titanica_df["Age"].iloc[3])

39.25

In [75]:
enc_titanica_df["Age_years"] = enc_titanica_df["Age"].apply(lambda age: extract_age_enc_titanica(age))

(Male)
(Male)

In [79]:
for item in enc_titanica_df[enc_titanica_df["Age"] == "(Male)"]["URL"]:
    print(item)

https://www.encyclopedia-titanica.org/titanic-victim/stanio-gheorgheff.html
https://www.encyclopedia-titanica.org/titanic-victim/theodor-kraeff.html

In [81]:
enc_titanica_df["Age_years"].isna().sum()

491

In [31]:
def extract_sex_enc_titanica(age):
    return age.split("(")[1].replace(")", "")

In [32]:
extract_sex_enc_titanica(enc_titanica_df["Age"].iloc[1])

'Male'

In [33]:
enc_titanica_df["Sex"] = enc_titanica_df["Age"].apply(lambda age: extract_sex_enc_titanica(age))

In [34]:
enc_titanica_df["Name"].iloc[4].split(" ")[1]

'Mr'

In [35]:
all_df["Name"].iloc[0]

'Braund, Mr. Owen Harris'

In [36]:
all_df["Name"].iloc[1]

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [37]:
all_df["Name"].iloc[1].split(",")[0]

'Cumings'

In [38]:
def extract_surname_titanic_data(name):
    return name.split(",")[0]

In [39]:
extract_surname_titanic_data(all_df["Name"].iloc[0])

'Braund'

In [40]:
all_df["Name"].iloc[0]

'Braund, Mr. Owen Harris'

In [41]:
all_df["Surname"] = all_df["Name"].apply(lambda name: extract_surname_titanic_data(name))

In [42]:
all_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen

In [43]:
all_df.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,Spector
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,Oliva y Ocana
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,Saether
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,Ware
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,Peter